import pandas as pd
import pytest


@pytest.fixture
def transactions_df():
    return pd.DataFrame(
        [
            {
                "Дата операции": "10.05.2025 10:00:00",
                "Категория": "Супермаркеты",
                "Сумма платежа": -100.0,
                "Описание": "Перевод Кредитная карта. ТП 10.2 RUR",
                "Валюта платежа": "RUB",
            },
            {
                "Дата операции": "10.01.2024 10:00:00",
                "Категория": "Супермаркеты",
                "Сумма платежа": -100.0,
                "Описание": "Пополнение через Газпромбанк",
                "Валюта платежа": "RUB",
            },
            {
                "Дата операции": "15.02.2024 12:30:00",
                "Категория": "Супермаркеты",
                "Сумма платежа": -250.0,
                "Описание": "РЖД",
                "Валюта платежа": "RUB",
            },
            {
                "Дата операции": "20.03.2024 09:15:00",
                "Категория": "Рестораны",
                "Сумма платежа": -800.0,
                "Описание": "Колхоз",
                "Валюта платежа": "RUB",
            },
            {
                "Дата операции": "05.04.2024 18:45:00",
                "Категория": "Супермаркеты",
                "Сумма платежа": -320.0,
                "Описание": "Галамарт",
                "Валюта платежа": "USD",
            },
            {
                "Дата операции": "01.12.2023 11:00:00",
                "Категория": "Супермаркеты",
                "Сумма платежа": -50.0,
                "Описание": "Mouse Tail",
                "Валюта платежа": "RUB",
            },
        ]
    )


@pytest.fixture
def mock_transactions():
    return [
        {
            "Дата операции": "10.05.2025 10:00:00",
            "Категория": "Супермаркеты",
            "Сумма платежа": -100.0,
            "Описание": "Перевод Кредитная карта. ТП 10.2 RUR",
            "Валюта платежа": "RUB",
            "Статус": "FAILED",
        },
        {
            "Дата операции": "10.01.2024 10:00:00",
            "Категория": "Супермаркеты",
            "Сумма платежа": -100.0,
            "Описание": "Пополнение через Газпромбанк",
            "Валюта платежа": "RUB",
            "Статус": "OK",
        },
        {
            "Дата операции": "15.02.2024 12:30:00",
            "Категория": "Супермаркеты",
            "Сумма платежа": -250.0,
            "Описание": "РЖД",
            "Валюта платежа": "EUR",
            "Статус": "FAILED",
        },
        {
            "Дата операции": "20.03.2024 09:15:00",
            "Категория": "Рестораны",
            "Сумма платежа": -800.0,
            "Описание": "Колхоз",
            "Валюта платежа": "RUB",
            "Статус": "OK",
        },
        {
            "Дата операции": "05.04.2024 18:45:00",
            "Категория": "Супермаркеты",
            "Сумма платежа": -320.0,
            "Описание": "Галамарт",
            "Валюта платежа": "USD",
            "Статус": "FAILED",
        },
        {
            "Дата операции": "01.12.2023 11:00:00",
            "Категория": "Супермаркеты",
            "Сумма платежа": -1050.0,
            "Описание": "Mouse Tail",
            "Валюта платежа": "RUB",
            "Статус": "OK",
        },
        {
            "Дата операции": "01.12.2022 11:00:00",
            "Категория": "Фастфуд",
            "Сумма платежа": -350.0,
            "Описание": "Tail",
            "Валюта платежа": "RUB",
            "Статус": "OK",
        },
        {
            "Дата операции": "01.12.2021 11:00:00",
            "Категория": "Супермаркеты",
            "Сумма платежа": -70.0,
            "Описание": "Mouse ",
            "Валюта платежа": "RUB",
            "Статус": "OK",
        },
    ]
